pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_semantics.cpp
      const enumGalgasBool test_31 = var_bootloaderReservedRAMmap.reader_hasKey (enumerator_9936.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (206)) COMMA_SOURCE_FILE_AT_LINE (206)).boolEnum () ;
      if (kBoolTrue == test_31) {
        GALGAS_luint var_bootloaderReservedSize ;
        var_bootloaderReservedRAMmap.method_searchKey (enumerator_9936.current_lkey (HERE), var_bootloaderReservedSize, inCompiler COMMA_SOURCE_FILE_AT_LINE (208)) ;
        const enumGalgasBool test_32 = GALGAS_bool (kIsStrictSup, enumerator_9936.current_mFirstFreeAddress (HERE).substract_operation (enumerator_9936.current_mFirstAddress (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (209)).objectCompare (var_bootloaderReservedSize.reader_uint (SOURCE_FILE_AT_LINE (209)))).boolEnum () ;
        if (kBoolTrue == test_32) {
          inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("for '").operator_concat (enumerator_9936.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (210)) COMMA_SOURCE_FILE_AT_LINE (210)).operator_concat (GALGAS_string ("' RAM bank, the bootloader implementation declares ") COMMA_SOURCE_FILE_AT_LINE (210)).operator_concat (enumerator_9936.current_mFirstFreeAddress (HERE).substract_operation (enumerator_9936.current_mFirstAddress (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (211)).reader_string (SOURCE_FILE_AT_LINE (211)) COMMA_SOURCE_FILE_AT_LINE (210)).operator_concat (GALGAS_string (" byte(s), althought the bootloader specification reserves ") COMMA_SOURCE_FILE_AT_LINE (211)).operator_concat (var_bootloaderReservedSize.reader_uint (SOURCE_FILE_AT_LINE (213)).reader_string (SOURCE_FILE_AT_LINE (213)) COMMA_SOURCE_FILE_AT_LINE (212)).operator_concat (GALGAS_string (" byte(s)") COMMA_SOURCE_FILE_AT_LINE (213)) COMMA_SOURCE_FILE_AT_LINE (210)) ;
        }
      }else if (kBoolFalse == test_31) {
        const enumGalgasBool test_33 = GALGAS_bool (kIsStrictSup, enumerator_9936.current_mFirstFreeAddress (HERE).objectCompare (enumerator_9936.current_mFirstAddress (HERE))).boolEnum () ;
        if (kBoolTrue == test_33) {
          inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("for '").operator_concat (enumerator_9936.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (217)) COMMA_SOURCE_FILE_AT_LINE (217)).operator_concat (GALGAS_string ("' RAM bank, the bootloader implementation declares ") COMMA_SOURCE_FILE_AT_LINE (217)).operator_concat (enumerator_9936.current_mFirstFreeAddress (HERE).substract_operation (enumerator_9936.current_mFirstAddress (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (218)).reader_string (SOURCE_FILE_AT_LINE (218)) COMMA_SOURCE_FILE_AT_LINE (217)).operator_concat (GALGAS_string (" byte(s), althought the bootloader specification reserves no space") COMMA_SOURCE_FILE_AT_LINE (218)) COMMA_SOURCE_FILE_AT_LINE (217)) ;
        }
      }
      enumerator_9936.gotoNextObject () ;
    }
  }
  GALGAS_uint var_RAMsize = GALGAS_uint ((PMUInt32) 0U) ;
  cEnumerator_ramBankTable enumerator_10929 (var_ramBank, kEnumeration_up) ;
  while (enumerator_10929.hasCurrentObject ()) {
    const enumGalgasBool test_34 = GALGAS_bool (kIsStrictSup, enumerator_10929.current_mLastAddressPlusOne (HERE).objectCompare (var_RAMsize)).boolEnum () ;
    if (kBoolTrue == test_34) {
      var_RAMsize = enumerator_10929.current_mLastAddressPlusOne (HERE) ;
    }
    enumerator_10929.gotoNextObject () ;
  }
  {
  routine_build_5F_ipic_31__38__5F_block_5F_representation_5F_list (constinArgument_inSourceFileName, var_piccoloDeviceModel.mAttribute_mRomSize.mAttribute_uint.reader_sint_36__34_ (SOURCE_FILE_AT_LINE (233)), var_RAMsize.reader_sint_36__34_ (SOURCE_FILE_AT_LINE (234)), var_bootloaderRoutineDeclarationListForBootloaderImplementation, var_userRoutineDeclarationListForBootloaderImplementation, var_bootloaderReservedROMsize, var_bootloaderRoutineDeclarationListForUserProgramImplementation, var_userRoutineDeclarationListForUserProgramImplementation, var_accessBankSplitOffset, var_registerTable, var_declaredByteMap, var_routineDefinitionList, constinArgument_inPiccoloModel.mAttribute_mProgramKind, constinArgument_inPiccoloModel.mAttribute_mConstantDefinitionList, constinArgument_inPiccoloModel.mAttribute_mDataList, var_interruptDefinitionList, constinArgument_inPiccoloModel.mAttribute_mUnusedRegisterList, var_ramBank, var_hasHighInterrupt, var_hasLowInterrupt, var_piccoloDeviceModel.mAttribute_mDeviceName.mAttribute_string, var_piccoloDeviceModel.mAttribute_mRegisterTable, var_actualConfigurationMap, constinArgument_inPiccoloModel.mAttribute_mEndOfProgram, var_listFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (231)) ;
  }
  const enumGalgasBool test_35 = GALGAS_bool (gOption_piccolo_5F_options_ouputListingFile.reader_value ()).boolEnum () ;
  if (kBoolTrue == test_35) {
    var_listFileContents.dotAssign_operation (GALGAS_string ("*******************************************************************************\n") COMMA_SOURCE_FILE_AT_LINE (260)) ;
    GALGAS_string var_listFile = constinArgument_inSourceFileName.reader_stringByDeletingPathExtension (SOURCE_FILE_AT_LINE (261)).operator_concat (GALGAS_string (".list") COMMA_SOURCE_FILE_AT_LINE (261)) ;
    GALGAS_bool joker_12452_0 ; // Joker input parameter
    var_listFileContents.method_writeToFileWhenDifferentContents (var_listFile, joker_12452_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (262)) ;
  }
}


//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


